//===========================================================================
//! @file	app_main.h
//!	@brief	アプリケーションメイン処理
//===========================================================================
#pragma once

#include "scene/app_manager_scene.h"

//===========================================================================
//!	@class AppMainSystem
//===========================================================================
class AppMainSystem
{
public:
    //-----------------------------------------------------------------------
    //!	@name	初期化
    //-----------------------------------------------------------------------
    //@{

    //! @brief コンストラクタ
    AppMainSystem() = default;

    //! @brief デストラクタ
    ~AppMainSystem() = default;

    //-----------------------------------------------------------------------
    //! @name タスク
    //-----------------------------------------------------------------------
    //@{

	//-----------------------------------------------------------------------
    //! @brief 初期化
    //! @param	[in]	w		ウィンドウ高さ
    //! @param	[in]	h		ウィンドウ横幅
    //! @param	[in]	hWnd	ウィンドウハンドル
    //! @return [out]
	//-----------------------------------------------------------------------
    bool initialize(u32 w, u32 h, HWND hWnd);

    //! @brief 更新
    void run();

    //! @brief 解放
    void finalize();

    //@}

private:
    //! @brief 現在のシーンが終わったかどうか
    bool isSceneEnd();

	//-----------------------------------------------------------------------
    //! @brief 指定されたシーンに移行
    //! @param	[in]	sceneBase	移行したいシーンのポインタ
    //! @return [out]
	//-----------------------------------------------------------------------
    bool sceneJump(SceneBase* sceneBase);

private:
    std::unique_ptr<KeyInput>        inputKey_;       //!< キー入力
    std::unique_ptr<AppSceneManager> sceneManager_;   //!< シーンマネージャー

    bool isImGui_ = true;   //!< ImGui描画フラグ
};
