//===========================================================================
//! @file	model_fbx.cpp
//!	@breif	FBXモデルクラス
//===========================================================================

//---------------------------------------------------------------------------
//! 描画
//---------------------------------------------------------------------------
void ModelFBX::render(const Matrix& matWorld)
{
    // 座標系補正 * モデルスケール * 親行列
	Matrix m =
		Matrix::rotateX(DEG_TO_RAD(-90.0f)) *
		//Matrix::rotateZ(DEG_TO_RAD(-90.0f)) *
		matWorld;

    // メッシュ描画(行列更新は [Model::render] 内でやってる)
    Model::render(m);
}