//===========================================================================
//!	@file	gpu_inputLayout.cpp
//!	@brief	入力レイアウト
//===========================================================================
namespace gpu {

//---------------------------------------------------------------------------
//! 作成
//---------------------------------------------------------------------------
bool InputLayout::create(const gpu::ShaderVs& shaderVs)
{
    //=============================================================
    // 入力レイアウトの作成
	//=============================================================
    device::D3DDevice()->CreateInputLayout(
        desc_.data(),                     // D3D11_INPUT_ELEMENT_DESCの先頭
        UINT(desc_.size()),               // 要素数
        shaderVs.getShaderBinary(),       // 頂点シェーダーのシェーダーバイナリー
        shaderVs.getShaderBinarySize(),   // 頂点シェーダーのバイナリーサイズ
        &inputLayout_);

    if(!inputLayout_)
        return false;

    return true;
}

//---------------------------------------------------------------------------
//! D3D入力レイアウトを取得
//---------------------------------------------------------------------------
ID3D11InputLayout* InputLayout::getInputLayout()
{
    return inputLayout_.Get();
}

}   // namespace gpu
