//===========================================================================
//! @file	camera_fps.h
//!	@brief	一人称カメラ
//===========================================================================
#pragma once

//===========================================================================
//! @class CameraFPS
//===========================================================================
class CameraFPS : public Camera
{
public:
    //-----------------------------------------------------------------------
    //!	@name 初期化
    //-----------------------------------------------------------------------
    //@{

    //! @brief コンストラクタ
    CameraFPS();

    //! @brief デストラクタ
    virtual ~CameraFPS() override = default;

    //@}
    //-----------------------------------------------------------------------
    //!	@name タスク
    //-----------------------------------------------------------------------
    //@{

	//-----------------------------------------------------------------------
    //! @brief 初期化
	//! @return true  正常終了
	//! @return false エラー終了
	//-----------------------------------------------------------------------
    virtual bool initialize() override;

    //! @brief 更新
    virtual void update() override;

    //! @brief 解放
    virtual void cleanup() override;

    //! @brief ImGui
    void showImGuiWindow() override;

    //@}

private:
    std::unique_ptr<KeyInput> inputKey_;   //!< キー入力用

    Vector2 oldPoint_  = Vector2::ZERO;   //!< 1フレーム前の座標
    f32     moveSpeed_ = 0.3f;            //!< 移動スピード
};