//===========================================================================
//! @file	camera.h
//!	@brief	カメラ
//===========================================================================
#pragma once

//! カメラの種類
enum class CameraType : u32
{
    None = 0,   //!< 初期化用

    Fps,   //!< 一人称カメラ
    Tps,   //!< 三人称カメラ

    Max
};

//===========================================================================
//! @class Camera
//===========================================================================
class Camera : public ObjectBase
{
public:
    //-----------------------------------------------------------------------
    //!	@name 初期化
    //-----------------------------------------------------------------------
    //@{

    //! @brief コンストラクタ
    Camera() = default;

    //! @brief デストラクタ
    virtual ~Camera() = default;

    //@}
    //-----------------------------------------------------------------------
    //!	@name タスク
	//-----------------------------------------------------------------------
    //@{

	//-----------------------------------------------------------------------
    //! @brief 初期化
	//! @return true  正常終了
	//! @return false エラー終了
	//-----------------------------------------------------------------------
    virtual bool initialize() override;

    //! @brief 更新
    virtual void update() override;

    //! @brief 解放
    virtual void cleanup() override;

    //! @brief IMGUI
    virtual void showImGuiWindow() override{};

    //@}
    //-----------------------------------------------------------------------
    //!	@name 設定
    //-----------------------------------------------------------------------
    //@{

	//-----------------------------------------------------------------------
    //! @brief 注視点を設定
	//! @param [in] position 位置
	//-----------------------------------------------------------------------
    inline void setLookAt(const Vector3& position);

	//-----------------------------------------------------------------------
    //! @brief 真上ベクトルを設定
	//! @param [in] worldUp　上方向ベクトル
	//-----------------------------------------------------------------------
    inline void setWorldUp(const Vector3& worldUp);

	//-----------------------------------------------------------------------
    //! @brief アスペクト比設定
	//! @param [in] aspectRatio アスペクト比
	//-----------------------------------------------------------------------
    inline void setAspectRatio(f32 aspectRatio);

	//-----------------------------------------------------------------------
    //! @brief Near Far 設定
	//! @param [in] zNear 近クリップ
	//! @param [in] zFar 遠クリップ
	//-----------------------------------------------------------------------
    inline void setNearFar(f32 zNear, f32 zFar);   //!< defineで定義されていたので、一応別の名前つけてる

	//-----------------------------------------------------------------------
    //! @brief 感度設定
	//! @param [in] sensitivity 感度
	//-----------------------------------------------------------------------
    inline void setSensitivity(f32 sensitivity);

    //@}
    //-----------------------------------------------------------------------
    //!	@name 取得
    //-----------------------------------------------------------------------
    //@{

	//-----------------------------------------------------------------------
    //! @brief ワールド行列を取得
	//! @return ワールド行列
	//-----------------------------------------------------------------------
    inline Matrix getMatWorld() const;

	//-----------------------------------------------------------------------
    //! @brief ビュー行列を取得
	//! @return ビュー行列
	//-----------------------------------------------------------------------
    inline Matrix getMatView() const;

	//-----------------------------------------------------------------------
    //! @brief 投影行列取得
	//! @return 投影行列
	//-----------------------------------------------------------------------
    inline Matrix getMatProj() const;

	//-----------------------------------------------------------------------
    //! @brief 注視点を取得
	//! @return 注視点
	//-----------------------------------------------------------------------
    inline Vector3 getLookAt() const;

	//-----------------------------------------------------------------------
    //! @brief 真上ベクトルを取得
	//! @return 真上ベクトル
	//-----------------------------------------------------------------------
    inline Vector3 getWorldUp() const;

    //@}

protected:
    CameraType cameraType_ = CameraType::None;   //!< 自身のカメラタイプ

    Matrix matView_ = Matrix::identity();   //!< ビュー行列
    Matrix matProj_ = Matrix::identity();   //!< プロジェクション行列

    Vector3 lookAt_  = Vector3::ZERO;               //!< 注視点
    Vector3 worldUp_ = Vector3(0.0f, 1.0f, 0.0f);   //!< 世界の上ベクトル

    f32 fovY_        = DirectX::XM_PIDIV4;   //!< 画角
    f32 aspectRatio_ = 16.0f / 9.0f;         //!< アスペクト比
    f32 near_        = 0.01f;                //!< 近クリップ面
    f32 far_         = 1000.0f;              //!< 遠クリップ面
    f32 sensitivity_ = 0.003f;               //!< 感度
};

// インラインヘッダ
#include "object/camera/camera_impl.h"