//===========================================================================
//! @file	scene_water.h
//!	@brief	水用シーン
//===========================================================================
#pragma once

//===========================================================================
//!	@class SceneWater
//===========================================================================
class SceneWater : public DemoSceneBase
{
public:
    //-----------------------------------------------------------------------
    //!	@name	初期化
    //-----------------------------------------------------------------------
    //@{

    //! @brief コンストラクタ
    SceneWater();

    //! @brief デストラクタ
    ~SceneWater() override = default;

    //@}

private:
    //-----------------------------------------------------------------------
    //!	@brief	初期化まとめてるだけ
    //-----------------------------------------------------------------------
    //@{

    //-----------------------------------------------------------------------
    //! @brief ライト初期化
    //! @return true  正常終了
    //! @return false エラー終了
    //-----------------------------------------------------------------------
    bool initializeLight() override;

    //-----------------------------------------------------------------------
    //! @brief モデル初期化
    //! @return true  正常終了
    //! @return false エラー終了
    //-----------------------------------------------------------------------
    bool initializeModel() override;

    //-----------------------------------------------------------------------
    //! @brief テクスチャ初期化
    //! @return true  正常終了
    //! @return false エラー終了
    //-----------------------------------------------------------------------
    bool initializeTexture() override;

    //@}

public:
    //-----------------------------------------------------------------------
    //!	@name	タスク
    //-----------------------------------------------------------------------
    //@{

    //! @brief 初期化
    //! @brief 波の数値初期化
    //! @return true  正常終了
    //! @return false エラー終了
    //-----------------------------------------------------------------------
    bool initialize() override;

    //! @brief 更新
    void update(f32 deleteTime) override;

	//-----------------------------------------------------------------------
    //! @brief 描画(描画モード指定)
    //! @param [in] renderMode 描画したいモード
	//-----------------------------------------------------------------------
    void render(RenderMode renderMode) override;

    //! @brief 解放
    void cleanup() override;

    //! @brief ImGui描画
    void showImGuiWindow() override;

    //@}

private:
    std::shared_ptr<gpu::Texture> buffer_;   //!< 水用テクスチャバッファ
};