//===========================================================================
//! @file	ibl.h
//!	@brief	IBL管理
//===========================================================================
#pragma once

//! IBL種類
enum class IBLTextureType : u32
{
    None = 0,     //
    Wilderness,   // 荒野
    Forest,       // 森
	RuinCastle,   // 城跡
	BlueSky,     // 空
    NullBlack,
};

//===========================================================================
//! @clsss IBL
//===========================================================================
class IBL
{
public:
    //-----------------------------------------------------------------------
    //!	@name	初期化
    //-----------------------------------------------------------------------
    //@{

    //! @brief コンストラクタ
    IBL() = default;

    //! @brief デストラクタ
    ~IBL() = default;

    //@}
    //-----------------------------------------------------------------------
    //!	@name	タスク
    //-----------------------------------------------------------------------
    //@{

	//-----------------------------------------------------------------------
    //! @brief 初期化
    //! @param	[in]	テクスチャ解像度
    //! @return true	初期化成功
    //! @return false	初期化失敗
	//-----------------------------------------------------------------------
    bool initialize(s32 resolution = 2048);

    //! @brief 解放
    void cleanup();

    //! @brief 開始
    void begin();

    //! @brief 終了
    void end();

    //! @brief ImGui描画
    void showImGuiWindow();

    //@}
    //-----------------------------------------------------------------------
    //!	@name	設定
    //-----------------------------------------------------------------------
    //@{

	//-----------------------------------------------------------------------
    //! @brief IBLテクスチャタイプ設定
	//! @param [in] type IBLテクスチャタイプ
	//-----------------------------------------------------------------------
    void setTextureType(IBLTextureType type);

    //@}

private:
	//-----------------------------------------------------------------------
    //! @brief テクスチャ変更
    //! @param	[in]	type		IBLテクスチャタイプ
    //! @return true	変更成功
    //! @return false	変更失敗
	//-----------------------------------------------------------------------
    bool chengeTexture(IBLTextureType type);

private:
    s32            resolution_         = 2048;                   //!< 解像度
    IBLTextureType currentTextureType_ = IBLTextureType::None;   //!< 現在のテクスチャタイプ
    IBLTextureType nextTextureType_    = IBLTextureType::None;   //!< 次のテクスチャタイプ

    std::weak_ptr<gpu::Texture> iblDiffuseTexture_;    //!< IBL用ディフーズテクスチャ
    std::weak_ptr<gpu::Texture> iblSpecularTexture_;   //!< IBL用スペキュラーテクスチャ
};
