//===========================================================================
//! @file	filter_glare.h
//!	@brief	グレアフィルター
//===========================================================================
#pragma once

//===========================================================================
//! @class FilterGlare
//===========================================================================
class FilterGlare : public Filter
{
public:
    //-----------------------------------------------------------------------
    //!	@name	初期化
    //-----------------------------------------------------------------------
    //@{

    //! @brief コンストラクタ
    FilterGlare() = default;

    //! @brief デストラクタ
    virtual ~FilterGlare() = default;

    //@}
    //-----------------------------------------------------------------------
    //!	@name	タスク
    //-----------------------------------------------------------------------
    //@{

	//-----------------------------------------------------------------------
    //! @brief 初期化
	//!	@return	true	正常終了
	//!	@return	false	エラー終了
	//-----------------------------------------------------------------------
    bool initialize() override;

    //! @brief 開始
    void begin() override;

    //! @brief 解放
    void finalize() override;

    //@}

private:
	//!	グレアに必要な情報定義
    struct cbFilterGlare	
    {
        f32     stride_;
        f32     attenuation_;
        Vector4 dir_;
    };
    gpu::ConstantBuffer<cbFilterGlare> cbFilter_;   //!< 定数バッファ
};
