//===========================================================================
//! @file	filter_tone_mapping.cpp
//! @brife	トーンマッピングフィルタ
//===========================================================================

//---------------------------------------------------------------------------
//! 初期化
//---------------------------------------------------------------------------
bool ToneMapping::initialize()
{
	filterType_ = FilterType::ToneMapping;

    return true;
}

//---------------------------------------------------------------------------
//! 開始
//---------------------------------------------------------------------------
void ToneMapping::begin()
{
	auto hdrBuffer = GmRender()->getRenderBuffer();

	// SDRバックバッファを設定
	gpu::setRenderTarget(GmRender()->getRenderBuffer(0, false));

	dxTexture(hdrBuffer);

	// トーンマッピングフィルターシェーダー設定
	gpu::setShader("vsPrim2D", "psToneMap");

	GmRender()->put();
}

//---------------------------------------------------------------------------
//! 解放
//---------------------------------------------------------------------------
void ToneMapping::finalize()
{
}